## Day 82 Lecture 1 Assignment

In this assignment, we will learn about activation functions. We will create a neural network and measure the model's performance using different activations.

In [1]:
import numpy as np
import pandas as pd

We will import the famous titanic dataset below and produce a neural network that will predict the chance of survival for a passenger.

In [2]:
titanic = pd.read_csv('https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/titanic.csv')

In [3]:
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

We'll perform some feature engineering

Let's start by keeping only the columns we'd like to use for our analysis. Keep only the columns: Survived, Pclass, Sex, SibSp, Parch, and Embarked

In [4]:
# Answer below:
cols = ['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked']
df = titanic.loc[:, cols]
df.head()

   Survived  Pclass     Sex  SibSp  Parch Embarked
0         0       3    male      1      0        S
1         1       1  female      1      0        C
2         1       3  female      0      0        S
3         1       1  female      1      0        S
4         0       3    male      0      0        S

Now examine how many rows contain missing data. Given how much missing data we have, should we remove the column with the most missing data, or remove all rows containing missing data? Do what you think is best.

In [5]:
# Answer below: 
df.isnull().sum()
print(df.shape)
titanic_df = df.dropna(axis=0)
print(titanic_df.shape)

(891, 6)
(889, 6)

Now we'll create a one hot encoding of the variables Pclass, sex, and Embarked

In [6]:
titanic_df.Pclass.value_counts()

3    491
1    214
2    184
Name: Pclass, dtype: int64

In [7]:
# Answer below:
dummied = pd.get_dummies(titanic_df, columns=['Pclass', 'Sex', 'Embarked'], drop_first=True)
dummied.head()

   Survived  SibSp  Parch  Pclass_2  Pclass_3  Sex_male  Embarked_Q  Embarked_S
0         0      1      0         0         1         1           0           1
1         1      1      0         0         0         0           0           0
2         1      0      0         0         1         0           0           1
3         1      1      0         0         0         0           0           1
4         0      0      0         0         1         1           0           1

Split the data into train and test. 20% of the data should be set aside for testing. Use Survived as your target variable.

In [8]:
# Answer below
from sklearn.model_selection import train_test_split

X = dummied.drop(columns=['Survived'])
y = dummied.Survived

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [9]:
print(X.shape)
print(y.shape)

(889, 7)
(889,)

In [10]:
print(X_train.shape)
print(y_train.shape)

(711, 7)
(711,)

In [11]:
print(X_test.shape)
print(y_test.shape)

(178, 7)
(178,)

At this point, we are ready to create a model. Import `Sequential` and `Dense` from Keras

In [12]:
# Answer below:
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense

Create a model with 5 layers. The first layer should be a dense layer that receives the input, the last layer should be of size 1. You determine the remaining layer sizes.

Use a tanh activation for the output layer.

In [25]:
# Answer below
model = Sequential()

model.add(Dense(80, input_dim=X_train.shape[1], activation='relu'))
model.add(Dense(60, activation='relu'))
model.add(Dense(60, activation='relu'))
model.add(Dense(60, activation='relu'))
model.add(Dense(1, activation='tanh'))

Compile the model using the adam optimizer, binary crossentropy loss, and the accuracy metric.

Fit the model using a batch size of 80 over 200 epochs.

In [37]:
# Answer below:
model.compile(loss='binary_crossentropy', optimizer='adam', metrics=['accuracy'])
model.fit(X_train, y_train, epochs=200, batch_size=80, validation_data=(X_test, y_test), verbose=0)
model.evaluate(X_test, y_test)[1]

6/6 [==============================] - 0s 2ms/step - loss: 0.7126 - accuracy: 0.7865

0.7865168452262878

Redefine the model using a sigmoid activation for the last layer. What is the difference in accuracy.

In [39]:
# Answer below

model = Sequential()

model.add(Dense(80, input_dim=X_train.shape[1], activation='relu'))
model.add(Dense(60, activation='relu'))
model.add(Dense(60, activation='relu'))
model.add(Dense(60, activation='relu'))
model.add(Dense(1, activation='sigmoid'))

In [40]:
model.compile(loss='binary_crossentropy', optimizer='adam', metrics=['accuracy'])
model.fit(X_train, y_train, epochs=200, batch_size=80, validation_data=(X_test, y_test), verbose=0)
model.evaluate(X_test, y_test)[1]

6/6 [==============================] - 0s 2ms/step - loss: 0.5343 - accuracy: 0.7865

0.7865168452262878